#include <iostream>
#include <cmath>
#include <print>

// Числа Фибоначчи начинаются с 0 и 1. Каждое следующее число -
// сумма двух предыдущих: 0, 1, 1, 2, 3, 5,
// Возьмем fi (примерно 1.618). Если начать с 1 и fi, то третьим
// числом должна стать их сумма: 1 + fi (примерно 2.618).
// При этом fi * fi тоже равно 1 + fi. Поэтому можно продолжать
// умножать на fi и каждый раз получать сумму двух предыдущих чисел.
// Для psi (примерно -0.618) верно то же самое: psi * psi = 1 + psi.
// Получились две последовательности, которые следуют одному правилу.
// Вычтем из каждого числа первой последовательности соответствующее
// число второй. Первым получим 1 - 1 = 0, вторым получим fi - psi = sqrt(5).
// Разделим все результаты на sqrt(5): начало станет 0, 1, а правило
// сложения двух предыдущих чисел сохранится. Это и есть Фибоначчи.

int fibonacciNumber(double fi, double psi, int n) {
    double number = (std::pow(fi, n) - std::pow(psi, n)) / std::sqrt(5);
    return static_cast<int>(std::round(number));
}

int main() {
    int n = 0;
    std::cin >> n;
    const double fi = (1 + std::sqrt(5)) / 2, psi = (1 - std::sqrt(5)) / 2;
    const int result = fibonacciNumber(fi, psi, n);
    std::print("{}\n", result);
}
